Revit 2026 API

# Mirror Class

---

A static class that provides access to the property names that appear in the Mirror visual asset schema.

SystemObject Autodesk.Revit.DB.VisualMirror

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Mirror
```
```vb
Public NotInheritable Class Mirror
```
```cpp
public ref class Mirror abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Mirror = class end
```

The Mirror type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Mirror" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Mirror" schema. |
|  | MirrorColorByObject | The property labeled "Color By Object" from the "Mirror" schema. |
|  | MirrorTintcolor | The property labeled "Color" from the "Mirror" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace